PX4/PX4-Autopilot/nuttx/arch/arm/src/lm3s/lm3s_gpio.c
  lm3s_gpiopadstrength(base, pin, cfgset);
  lm3s_gpiopadtype(base, pin, cfgset);

  /* Then set up the real pin function */

  lm3s_gpiofunc(base, pinno, &g_funcbits[func]);

  /* Special GPIO digital output pins */

  if (func == 1 || func == 3)
    {
      lm3s_initoutput(cfgset);
    }


  /* Special setup for interrupt GPIO pins */

  else if (func == 7)
    {
      lm3s_interrupt(base, pin, cfgset);
    }

  irqrestore(flags);
  return OK;
}

/****************************************************************************
 * Name: lm3s_gpiowrite
 *
 * Description:
 *   Write one or zero to the selected GPIO pin
 *
 ****************************************************************************/

void lm3s_gpiowrite(uint32_t pinset, bool value)
{
  unsigned int port;
  unsigned int pinno;
  uint32_t     base;

  /* Decode the basics */

  port  = (pinset & GPIO_PORT_MASK) >> GPIO_PORT_SHIFT;
  pinno = (pinset & GPIO_NUMBER_MASK);

  /* Get the base address associated with the GPIO port */

  base  = lm3s_gpiobaseaddress(port);

  /* "The GPIO DATA register is the data register. In software control mode,
   *  values written in the GPIO DATA register are transferred onto the GPIO
   *  port pins if the respective pins have been configured as outputs through
   *  the GPIO Direction (GPIO DIR) register ...
   *
   * "In order to write to GPIO DATA, the corresponding bits in the mask,
   *  resulting from the address bus bits [9:2], must be High. Otherwise, the
   *  bit values remain unchanged by the write. 
   *
   * "... All bits are cleared by a reset."
   */

  putreg32((uint32_t)value << pinno, base + LM3S_GPIO_DATA_OFFSET + (1 << (pinno + 2)));
}

/****************************************************************************
 * Name: lm3s_gpioread
 *
 * Description:
 *   Read one or zero from the selected GPIO pin
 *
 ****************************************************************************/

bool lm3s_gpioread(uint32_t pinset, bool value)
{
  unsigned int port;
  unsigned int pinno;
  uint32_t     base;

  /* Decode the basics */

  port  = (pinset & GPIO_PORT_MASK) >> GPIO_PORT_SHIFT;
  pinno = (pinset & GPIO_NUMBER_MASK);

  /* Get the base address associated with the GPIO port */

  base = lm3s_gpiobaseaddress(port);

  /* "... the values read from this register are determined for each bit
   *  by the mask bit derived from the address used to access the data register,
   *  bits [9:2]. Bits that are 1 in the address mask cause the corresponding
   *  bits in GPIODATA to be read, and bits that are 0 in the address mask cause
   *  the corresponding bits in GPIO DATA to be read as 0, regardless of their
   *  value.
   *
   * "A read from GPIO DATA returns the last bit value written if the respective
   *  pins are configured as outputs, or it returns the value on the
   *  corresponding input pin when these are configured as inputs. All bits
   *  are cleared by a reset."
   */

  return (getreg32(base + LM3S_GPIO_DATA_OFFSET + (1 << (pinno + 2))) != 0);
}

